package ch10;

public class MethodProb {

    // int[] 점수를 전달받아서 총점을 전달받아서 평균을 계산해서 반환하는 매서드


    // int 총점을 전달받아서 평균을 계산해서 반환하는 매서드
    // 평균은 소수도 표현해야 함

    // int[] 점수를 전달받아서 총점과 평균을 전달 받아서 출력하는 매서드
    // 총점 : 268, 평균 : 89.4



    void main(){
        //총점을 계산해서 반환하는 매서드



        // haru는 국어, 영어, 수학 점수가 각각 80,70,56이다.
        // namu는 국어, 영어, 수학 점수가 각각 90,77,80이다.
        // brong이는 국어, 영어, 수학 점수가 각각 100,99,88이다.


        // 이 셋의 총점과 평균을 구해서 출력하세요.

        int[] haruScore ={80,70,56};

    }
}
